Обработки/Reports/_ОтчетПоПартиямДляППА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоПартиямДляППА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьДисконты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоПартиямДляППА/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет по партиям для ППА",
		"0.10",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,РасчитыватьДисконты");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	Отказ = Ложь;
	СтандартнаяОбработка = Ложь;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.ДатаОтчета = Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.СчетДУ = ЭтотОбъект.СчетДоверительногоУправления;
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ДокументРезультат.ФиксацияСверху = 5;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Период, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК Код,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагОстатки.Партия.Дата КАК ПартияДата,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток КАК ДисконтПремияОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйРасход КАК ДисконтПремияНачисленныйРасход
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|				&НачальнаяДата,
		|				&Период,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|					И ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации).Амортизационная) КАК БухПартииЦенныхБумагОбороты
		|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = БухПартииЦенныхБумагОбороты.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстатки.Партия = БухПартииЦенныхБумагОбороты.Партия
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = БухПартииЦенныхБумагОбороты.СтрокаПартии
		|ГДЕ
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеннаяБумага,
		|	ПартияДата";
	
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", 						Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачальнаяДата", 					'20151213');
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	ДанныеПартий = Запрос.Выполнить().Выгрузить();
	
	ДанныеПартий.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	
	ДанныеПартийКоличество = ДанныеПартий.Количество();
	Для Инд = 1 По ДанныеПартийКоличество Цикл
		ДанныеПартий[Инд - 1].НомерСтроки = Инд;
	КонецЦикла;
	
	ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ДанныеПартий, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период).Выгрузить();
	
	Для каждого СтрокаДанныеПартий Из ДанныеПартий Цикл
	
		ОбластьСтрока.Параметры.НомПП = СтрокаДанныеПартий.НомерСтроки;
		ОбластьСтрока.Параметры.ЦБ = СтрокаДанныеПартий.ЦеннаяБумага;
		ОбластьСтрока.Параметры.ISIN = СтрокаДанныеПартий.Код;
		ОбластьСтрока.Параметры.Количество = СтрокаДанныеПартий.Количество;
		ОбластьСтрока.Параметры.ДатаПартии = НачалоДня(СтрокаДанныеПартий.ПартияДата);
		
		ДатаИЦенаПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаДанныеПартий.НомерСтроки));
		
		
		ДанныеПереоценки = Новый Структура;
		ДанныеПереоценки.Вставить("ДатаПереоценки", КонецДня(ЭтотОбъект.Период));
		ДанныеПереоценки.Вставить("Количество", СтрокаДанныеПартий.Количество);
		ДанныеПереоценки.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ДанныеПереоценки.Вставить("УчетныйАктивЕПС", СтрокаДанныеПартий.УчетныйАктивЕПС);
		
		ДанныеПокупки = Новый Структура;
		ДанныеПокупки.Вставить("НачальныйДисконт", ДатаИЦенаПокупки[0].НачальныйДисконт);
		ДанныеПокупки.Вставить("ДатаПокупки", ДатаИЦенаПокупки[0].ДатаПокупки);
		ДанныеПокупки.Вставить("ЦенаПокупки", ДатаИЦенаПокупки[0].ЦенаПокупки);
		
		ДанныеРасчетаДисконтаПремии = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремии(СтрокаДанныеПартий.ЦеннаяБумага, НастройкиУчета, ДанныеПереоценки, ДанныеПокупки, Отказ);
		
		Если ЭтотОбъект.РасчитыватьДисконты Тогда
			ОбластьСтрока.Параметры.ДисконтНачальный =  - ДатаИЦенаПокупки[0].НачальныйДисконт * СтрокаДанныеПартий.Количество;
			ОбластьСтрока.Параметры.ДисконтНачисленный = Окр(ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия, 2) + Окр(ДанныеРасчетаДисконтаПремии.ПогашенияДисконтов, 2);
			ОбластьСтрока.Параметры.ДисконтПогашенный = Окр(ДанныеРасчетаДисконтаПремии.ПогашенияДисконтов * СтрокаДанныеПартий.Количество, 2);
		Иначе
			ОбластьСтрока.Параметры.ДисконтНачальный = - СтрокаДанныеПартий.ДисконтПремияОстаток;
			ОбластьСтрока.Параметры.ДисконтНачисленный = СтрокаДанныеПартий.ДисконтПремияНачисленныйОстаток;
			ОбластьСтрока.Параметры.ДисконтПогашенный = СтрокаДанныеПартий.ДисконтПремияНачисленныйРасход;
		КонецЕсли;																			
																			
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;

	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
